app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        $ipAddress = new CaptureIpTrait();
        $role = Role::where('slug', '=', 'unverified')->first();
---
select * from `roles` where `slug` = 'unverified' limit 1