app/Http/Controllers/UsersManagementController.php

select * from `roles`
---
    public function index()
    {
        $pagintaionEnabled = config('usersmanagement.enablePagination');
        if ($pagintaionEnabled) {
            $users = User::paginate(config('usersmanagement.paginateListSize'));
        } else {
            $users = User::all();
        }
        $roles = Role::all();

insert into `profiles` (`user_id`, `updated_at`, `created_at`) values (12, '2019-03-01 12:41:48', '2019-03-01 12:41:48')
---
            'activated'        => 1,
        ]);

        $user->profile()->save($profile);

update `users` set `deleted_ip_address` = '71.192.175.237', `updated_at` = '2019-03-01 21:06:33' where `id` = '16'
---
    public function destroy($id)
    {
        $currentUser = Auth::user();
        $user = User::findOrFail($id);
        $ipAddress = new CaptureIpTrait();

        if ($user->id != $currentUser->id) {
            $user->deleted_ip_address = $ipAddress->getClientIp();
            $user->save();